## ✅ Tofu Plan Output
```
module.function.data.archive_file.source_code: Reading...
module.function.data.archive_file.source_code: Read complete after 0s [id=1f4bda57a7c21743826cf933ed10dbfd09ac9f23]
module.function.data.aws_iam_policy_document.policy: Reading...
module.function.data.aws_iam_policy_document.allow_logging: Reading...
module.function.data.aws_iam_policy_document.allow_logging: Read complete after 0s [id=16712114]
module.function.data.aws_iam_policy_document.policy: Read complete after 0s [id=2690255455]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.function.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-sample"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.function.aws_iam_role_policy.allow_logging will be created
  + resource "aws_iam_role_policy" "allow_logging" {
      + id          = (known after apply)
      + name        = "lambda-sample-allow-logging"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "lambda-sample"
    }

  # module.function.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/lambda/lambda-sample.zip"
      + function_name                  = "lambda-sample"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-2"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "4RMcoX12uJ0TiszzUGsJVNMaL6z+o3t7JU7zTXg8j7c="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 5
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.gateway.aws_apigatewayv2_api.api will be created
  + resource "aws_apigatewayv2_api" "api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "lambda-sample"
      + protocol_type                = "HTTP"
      + region                       = "us-east-2"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.gateway.aws_apigatewayv2_integration.lambda will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + region                                    = "us-east-2"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.gateway.aws_apigatewayv2_route.lambda_route["GET /"] will be created
  + resource "aws_apigatewayv2_route" "lambda_route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-east-2"
      + route_key          = "GET /"
      + target             = (known after apply)
    }

  # module.gateway.aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + region        = "us-east-2"
      + tags_all      = (known after apply)

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = false
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 10000
          + throttling_rate_limit    = 10000
        }
    }

  # module.gateway.aws_lambda_permission.allow_invoke["GET /"] will be created
  + resource "aws_lambda_permission" "allow_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayToCallSampleAppLambda"
      + statement_id_prefix = (known after apply)
    }

  # module.test.data.http.test_endpoint will be read during apply
  # (config refers to values not yet known)
 <= data "http" "test_endpoint" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + method               = "GET"
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = (known after apply)
    }

  # module.test.time_sleep.wait will be created
  + resource "time_sleep" "wait" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_endpoint = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```